# Brewfile
# This file declares all brew formulae and casks to install on a fresh macOS machine.
# Usage:
#   brew bundle --file=./Brewfile
#
# To update from current system:
#   brew bundle dump --file=./Brewfile --force

# ----------------------------
# Homebrew taps
# ----------------------------
tap "homebrew/cask"
tap "homebrew/core"

# ----------------------------
# CLI Tools & Utilities (brew formulae)
# ----------------------------
brew "broot"        # Tree view navigation
brew "bat"          # Better cat with syntax highlighting
brew "bob"          # Neovim version manager
brew "cheat"        # Cheat sheets from command line
brew "dust"         # Disk usage visualization
brew "fd"           # Better find
brew "ffmpeg"       # Media processing
brew "fzf"          # Fuzzy finder
brew "gh"           # GitHub CLI
brew "git"          # Git SCM
brew "go"           # Go programming language
brew "hyperfine"    # CLI benchmarking
brew "just"         # Command runner / build tool
brew "lesspipe"     # Preprocessor for less
brew "mas"          # Mac App Store CLI
brew "ncspot"       # Spotify cli client
brew "rename"       # Batch renaming
brew "ripgrep"      # Fast search
brew "starship"     # Shell prompt
brew "stow"         # Symlink dotfiles manager
brew "tldr"         # Simplified man pages
brew "tree"         # Directory listing
brew "uv"           # Fast Python package installer
brew "wget"         # Download utility
brew "yt-dlp"       # YouTube video downloader
brew "zig"          # Zig programming language
brew "zoxide"       # Smarter cd command

# ----------------------------
# GUI Applications (brew casks)
# ----------------------------
cask "dbeaver-community"                               # Database client
cask "devtoys"                                         # Developer Swiss-army knife
cask "discord"                                         # Chat for communities
cask "jordanbaird-ice"                                 # Menu bar spacer utility
cask "keyclu"                                          # Shortcut cheat sheet
cask "localsend"                                       # Local file sharing
cask "maccy"                                           # Clipboard manager
cask "middleclick", args: { "no_quarantine" => true }  # Middle click gestures
cask "mos"                                             # Smooth mouse scrolling for mac
cask "orbstack"                                        # Containers & VMs
cask "pearcleaner"                                     # App uninstaller
cask "raycast"                                         # Productivity launcher
cask "spotify"                                         # Music
cask "sublime-text"                                    # Text editor
cask "visual-studio-code"                              # Code editor
cask "zed"                                             # Code editor
